#include "Common.h"
#include "Game.h"

int WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int)
{
    //-----------------------------------------------------------------------------//
    //									初期設定
    //-----------------------------------------------------------------------------//

    //ウィンドウモード：TRUE、フルスクリーン：FALSE
    ChangeWindowMode(TRUE);
    //ライブラリの初期化
    DxLib_Init();
    //画面解像度とカラービット数の設定
    SetGraphMode(SCREEN_SIZE_X, SCREEN_SIZE_Y, COLOR_BIT_NUM);
    //裏の画面にグラフィック領域を指定
    SetDrawScreen(DX_SCREEN_BACK);

    //-----------------------------------------------------------------------------//
    //									ゲームの処理
    //-----------------------------------------------------------------------------//

    //ゲームに使用するメモリの割り当て
    Game * game = new Game();

    //ゲームを開始
    game->GameLoop();

    //ゲームに使用したメモリの開放
    delete(game);

    //-----------------------------------------------------------------------------//
    //									終了処理
    //-----------------------------------------------------------------------------//

    //ライブラリの使用を終了
#ifndef _DEBUG
	DxLib_End();
#endif
    return 0;
}
